---
type: CylindricalFace
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# CylindricalFace

`Autodesk.Revit.DB.CylindricalFace` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Intersect | — | `` |
| Method | IsInside | — | `` |
| Method | Triangulate | — | `` |
| Property | Axis | — | `public XYZ Axis { get ; }` |
| Property | Origin | — | `public XYZ Origin { get ; }` |
| Property | Radius | — | `public XYZ this [ int index ] { get ; }` |